Revit 2027 API
ServerPath Constructor
 Constructs a ServerPath
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ServerPath(
	string centralServerLocation,
	string path
)
Public Sub New (
	centralServerLocation As String,
	path As String
)
public:
ServerPath(
	String^ centralServerLocation,
	String^ path
)
new :
        centralServerLocation : string *
        path : string -> ServerPath
Parameters
centralServerLocation String
 The name of the central Revit server
path String
 The path of the model. This path must be relative.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ServerPath Class
Autodesk.Revit.DB Namespace